{
  "main": {
    "name": "Md Asaduzzaman Ripan",
    "occupation": "Front End Developer",
    "description": "Love to build things with code and passionate of solving critical problems",
    "image": "photo.jpg",
    "bioUp": "I am a Web Developer with enthusiasm and focus on Frontend Development. My coding journey started during my M.Sc. in Computational Mechanics, where i have been introduced with the core structures such as data structure, algorithms, implementation and coding of algorithms for differential problems. Then the deciding factors were my student jobs and master thesis work where i had the chance to work in software development.",
    "bioMid": "Then i realized that i love to code and build stuffs. So what could be a good choice rather than the web development, where i can see my works live. ",
    "bioBot": "I am passionate about building scalable software, creating effective solutions and learning every day to grow professionally in the IT field.",
    "contactmessage": "Get in touch with me to receive further details. I would be happy to work with you.",
    "email": "aripan017@gmail.com",
    "phone": "+4917636715365",
    "address": {
      "street": "Gladbacher Str. 218",
      "city": "Krefeld",
      "state": "Germany",
      "zip": "47805"
    },
    "website": "#",
    "resumedownload": "CV.pdf",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/ar.rudra",
        "className": "fa fa-facebook"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/mdripan",
        "className": "fa fa-linkedin"
      },

      {
        "name": "github",
        "url": "http://github.com/aripan/",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Specialist in need. Generalist at heart",
    "education": [
      {
        "school": "University of Kent",
        "degree": "Masters in Advanced Computer Science",
        "graduated": "January 2017",
        "description": "Graduated with Distinction"
      }
    ],
    "work": [
      {
        "company": "Clever Programmer",
        "title": "Team Member && React Specialist",
        "years": "April 2020 - Present",
        "description": "Teaching ReactJS to thousands of students."
      },
      {
        "company": "Lindar Media",
        "title": "Software Engineer",
        "years": "Nov 2019 - April 2020",
        "description": "Building MrQ, a gambling website."
      }
    ],
    "skills": [
      {
        "name": "ReactJs",
        "level": "100%"
      },
      {
        "name": "CSS",
        "level": "95%"
      },
      {
        "name": "Git",
        "level": "60%"
      },
      {
        "name": "Figma && Adobe XD",
        "level": "55%"
      },
      {
        "name": "HTML5",
        "level": "80%"
      },
      {
        "name": "MongoDB",
        "level": "80%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "TreatUrHunger Restaurant",
        "categoryStart": "A full-stack web application is built for a restaurant using the (MERN) Stack. This app allows you to navigate through the pages, checkout the dishes as well as the comments, make an online reservation and send feedback. You can register as well to make a comment and customize the list of your favorite items.",
        "categoryEnd": "I used React, Redux as the frontend frameworks, Node/Express.js to create the REST API, JWT for user authentication and MongoDB  for data storage.",
        "image": "treaturhunger.JPG",
        "url": "https://treaturhunger.herokuapp.com/",
        "source": "https://github.com/aripan/treatUrHunger_Frontend"
      },

      {
        "title": "MERN-Shop eCommerce Web App",
        "categoryStart": "A full-stack web application is built for an eCommerce Website using the (MERN) Stack. This app allows you to navigate through the displayed product, checkout the review of the products, add items to Cart. To buy items, the user must be a registered user (or need to create one).",
        "categoryEnd": "I used React, Redux and React Hooks for frontend, Node/Express.js to create the REST API, JWT for user authentication and MongoDB  for data storage.",
        "image": "MERN-Shop.JPG",
        "url": "https://e-mern-shopapp.herokuapp.com/",
        "source": "https://github.com/aripan/MERN-eCommerce-Shop"
      },

      {
        "title": "Amazon-Clone",
        "categoryStart": "A simple and minimalistic clone of Amazon is built using React and Firebase (Backend-as-a-Service). This full-stack application allows you to see the available items, checkout an item to your basket as well as remove it from the basket.  Even the a registered user can buy the products using his/her cards.",
        "categoryEnd": "I used React, React Hooks for frontend part, Node to create the REST API, Firebase for user authentication, Cloud Firestore for data storage.",
        "image": "amazon-clone.JPG",
        "url": "https://react--clone-c8de9.web.app/",
        "source": "https://github.com/aripan/React-Amazon-Clone"
      },

      {
        "title": "My Blog App",
        "categoryStart": "A fully responsive Web Application that allows you to see all the listed blogs,  choose an individual blog to read its content as well as to create a new one new. This website do the basic CRUD operations.",
        "categoryEnd": "I used HTML5, CSS3 and Vanilla Javascript in order to build this web app. Node/Express.js is being used to create the REST API and JSON to store the data.",
        "image": "myblogapp.JPG",
        "url": "https://aripan.github.io/Blog-App/",
        "source": "https://github.com/aripan/Blog-App"
      },

      {
        "title": "Black Jack",
        "categoryStart": "A static web application is built to show the simplest form of Black Jack Game.",
        "categoryEnd": "I used HTML5, CSS3, JavaScript and Bootstrap4 in order to build this game.",
        "image": "blackJack.JPG",
        "url": "https://aripan.github.io/black_jack/",
        "source": "https://github.com/aripan/black_jack"
      },

      {
        "title": "Rock, Paper & Scissor",
        "categoryStart": "A static web application is built to show the simplest form of this Game.",
        "categoryEnd": "I used HTML5, CSS3 and Vanilla Javascript in order to build this game.",
        "image": "rps.jpg",
        "url": "https://aripan.github.io/rock_paper_scissor/",
        "source": "https://github.com/aripan/rock_paper_scissor"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user": "Kareem Abdul Jabbar"
      },
      {
        "text": "That Sonny Sangha must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user": "Steve Wozniak... impersonator"
      }
    ]
  }
}
